Repository: kawad852/eye_muslim
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Login
ar: تسجيل الدخول

source: Cancel
ar: إلغاء

# generalError
source: Oops, Something went wrong !
ar: عذرًا، حدث خطأ!

source: Required field
ar: حقل مطلوب

source: Invalid email
ar: بريد إلكتروني غير صالح

source: Invalid number
ar: رقم غير صالح

# cont
source: Continue
ar: متابعة

source: Confirm
ar: تأكيد

source: Add
ar: إضافة

# networkError
source: Internet Connection Error
ar: خطأ في اتصال الإنترنت

# makeSureYouAreConnectedToInternet
source: Make sure you are connected to the Internet and try again
ar: تأكد من أنك متصل بالإنترنت وحاول مرة أخرى

source: Retry
ar: إعادة المحاولة

source: Ok
ar: موافق

source: Invalid credentials
ar: بيانات الاعتماد غير صالحة

source: Get started
ar: ابدأ

source: Guest
ar: زائر

# conWithGoogle
source: Continue with Google
ar: المتابعة باستخدام Google

# conWithApple
source: Continue with Apple
ar: المتابعة باستخدام Apple

# conWithAPhone
source: Continue with Phone
ar: المتابعة باستخدام الهاتف

# conWithFacebook
source: Continue with Facebook
ar: المتابعة باستخدام Facebook

source: Discover
ar: اكتشف

# generalErrorTitle
source: Something Went Wrong
ar: حدث خطأ ما

# generalErrorBody
source: An unexpected error occurred. Please try again later or contact support.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم.

# connectionErrorTitle
source: Connection Error
ar: خطأ في الاتصال

# connectionErrorBody
source: Unable to reach the server. Please check your internet connection and try again.
ar: تعذر الوصول إلى الخادم. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.

# serverErrorTitle
source: Data Unavailable
ar: البيانات غير متوفرة

# serverErrorBody
source: We're currently having trouble retrieving data from the server. Please try again later.
ar: نواجه حاليًا مشكلة في استرداد البيانات من الخادم. يرجى المحاولة مرة أخرى لاحقًا.

# authFailed
source: Your account has been suspended due to unusual activities
ar: تم حظر حسابك بسبب أنشطة مخالفة

# loginToCont
source: login to continue
ar: للمتابعة يجب تسجيل الدخول

# accountDeletedMsg
source: Account deleted successfully
ar: تم حذف الحساب بنجاح

source: Home
ar: الرئيسية

source: Duties
ar: الواجبات

# explanation
source: Special explanation
ar: شرح خاص

source: Graduation projects
ar: مشاريع التخرج

source: Profile
ar: الحساب

source: Hello,
ar: مرحباً,

source: Helper
ar: المساعد

source: Pursue education
ar: متابعة التعليم

source: More
ar: المزيد

source: Distinguished lecturers
ar: محاضرين مميزين

source: course
ar: كورس

source: subscriber
ar: مشترك

# searchCourse
source: Search for the name of the course or part of a course
ar: ابحث عن اسم المادة او جزء من مادة

source: Lecturers
ar: المحاضرين

source: Courses
ar: الكورسات

source: video
ar: فيديو

source: axes
ar: محاور

# requestSolveAssignment
source: You can submit a request to solve an assignment or write a report and research by sending a new request
ar: يمكنك تقديم طلب حل واجب أو كتابة تقرير وبحث عن طريق إرسال طلب جديد

# sendNewRequest
source: Send a new request
ar: ارسال طلب جديد

source: Previous requests
ar: الطلبات السابقة

source: Request number
ar: رقم الطلب

# partNotUnderstood
source: Do you have a part that is not understood or does not exist in a artical? Simple! Request a special explanation now with ease and receive the video as quickly as possible.
ar: هل لديك جزئ غير مفهوم او غير موجود في مادة ؟ بسيطة ! اطلب شرح خاص الان بكل سهولة واستلم الفيديو بأسرع وقت.

source: Projects
ar: المشاريع

source: Project request
ar: طلب مشروع

# requestYourProject
source: Do you have a graduation project or a project for a subject? Easy! Request your project now from Al-Musaed with ease.
ar: هل لديك مشروع تخرج او مشروع لمادة ؟ سهله ! اطلب مشروعك الان من المساعد بكل سهولة.

source: Send Request
ar: ارسال طلب

# requestSolveAssignmentAndSendRequest
source: You can submit a request to solve an assignment or write a report and research by filling out the following form and sending the request
ar: يمكنك تقديم طلب حل واجب أو كتابة تقرير وبحث من خلال تعبئة النموذج التالي وارسال الطلب

source: Country
ar: الدولة

source: Select country
ar: اختر الدولة

source: University
ar: الجامعة

# selectUniversity
source: Select the university
ar: اختر الجامعة

source: College
ar: الكلية

# selectCollege
source: Select the college
ar: اختر الكلية

source: Specialization
ar: التخصص

# selectSpecialization
source: select the specialization
ar: اختر التخصص

source: Title
ar: العنوان

# titleOfReportOrResarch
source: Title of the assignment, report, or research
ar: عنوان الواجب او التقرير او البحث

source: Notes
ar: ملاحظات

# descriptionAboutAssignment
source: A description or notes about the assignment or report to be requested
ar: وصف او ملاحظات حول الواجب او التقرير المراد طلبه

source: Attach files and pictures
ar: ارفاق ملفات وصور

# attachPdfOrImages
source: You can attach pdf files or images
ar: يمكنك ارفاق ملفات pdf او صور

source: Send
ar: ارسال

# requestExplainArtical
source: You can submit a request to explain part of the article or title by filling out the following form and submitting the request
ar: يمكنك تقديم طلب شرح جزئ من مادة او عنوان من خلال تعبئة النموذج التالي وارسال الطلب

# requestGraduationProject
source: You can submit a request for a graduation project or subject project by filling out the following form and sending the request
ar: يمكنك تقديم طلب مشروع تخرج او مشروع مادة من خلال تعبئة النموذج التالي وارسال الطلب

# dateSendingRequest
source: Date and time of sending the request
ar: تاريخ ووقت إرسال الطلب

source: Attached Files
ar: الملفات المرفقة

source: Download
ar: تحميل

# assistantResponse
source: Al-Musaed's response
ar: رد المساعد

# contactTheAssistant
source: If you have any notes, you can contact the Al-Musaed
ar: اذا كان لديك اي ملاحظة ، يمكنك التواصل مع المساعد

source: pay
ar: دفع

# feesRequest
source: Fees due for completing the request
ar: الرسوم المستحقة لإنجاز الطلب

# timeRemainingPayment
source: Time remaining for payment
ar: الوقت المتبقي للدفع

source: Subscribers
ar: المشتركين

source: Total duration
ar: المدة الإجمالية

source: Videos
ar: فيديوهات

source: Join
ar: الإنضمام

# getPatFree
source: and now get part of the course for free
ar: واحصل الآن على جزء من الدورة مجاناً

source: Contents
ar: المحتويات

source: File
ar: ملف

# minute
source: minutes
ar: دقيقة

# second
source: seconds
ar: ثانية

source: hours
ar: ساعة

source: days
ar: أيام

source: free
ar: مجانا

source: subscribed
ar: تم الإشتراك

source: buying
ar: شراء

# discountEntireCourse
source: {value}% discount when purchasing the entire course
ar: خصم {value}% عند شراء الدورة بالكامل

source: About the teacher
ar: عن المدرس

source: Views
ar: مشاهدات

source: article
ar: مادة

source: Ratings
ar: التقييمات

source: View ratings
ar: عرض التقييمات

# basedOnRatings
source: Based on {value} ratings
ar: استنادا الى {value} تقييم

# searchLectureName
source: Search for a lecturer's name
ar: ابحث عن اسم محاضر

# subscribeSection
source: Subscribe to this section
ar: الإشتراك في هذا القسم

source: Account Number
ar: رقم الحساب

source: Articles
ar: مواد

# durationStudyWithMusaed
source: Duration of study with Al-Musaed
ar: مدة الدراسة مع المساعد

source: Article subscriptions
ar: اشتراكات المواد

source: Notifications
ar: الإشعارات

source: App language
ar: لغة التطبيق

# getKnowAlmusaed
source: Get to know Al-Musaed
ar: تعرف على المساعد

source: Privacy policy
ar: سياسة الخصوصية

source: Terms and Conditions
ar: الشروط والأحكام

# contactAlmusaed
source: Contact with Al-Musaed
ar: تواصل مع المساعد

source: Logout
ar: تسجيل الخروج

# guestBrowse
source: Browse as guest
ar: التصفح كضيف

# loginMsg
source: Please enter the following data to login
ar: يرجى إدخال البيانات التالية للدخول إلى حسابك

# phoneNum
source: Phone number
ar: رقم الهاتف المحمول

# searchCountryOrCode
source: Search for the country name or dial code
ar: إبحث عن إسم أو رمز البلد

source: Password too short
ar: كلمة المرور قصيرة

source: Password
ar: كلمة المرور

# forgotPassword
source: Did you forget your password ?
ar: هل نسيت كلمة المرور

source: Edit profile
ar: تعديل الحساب

source: Full Name
ar: الإسم الكامل

source: Current password
ar: كلمة المرور الحالية

source: New password
ar: كلمة المرور الجديدة

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

source: Enter password here
ar: ادخل كلمة المرور هنا

source: Delete Account
ar: حذف الحساب

source: Save
ar: حفظ

source: Edit
ar: تغيير

source: Enter your name here
ar: ادخل اسمك هنا

# distinctiveVerySimple
source: A distinctive and very simple way of explaining
ar: اسلوب مميز في الشرح وبسيط جداً

# solvedPleaseDownload
source: Solved, please download the attached file
ar: تم الحل, يرجى تحميل الملف المرفق

source: Now
ar: الآن

# videoHasBeenRecorded
source: The video has been recorded. We hope you watch it full of knowledge
ar: تم تسجيل الفيديو نتمنى لك مشاهدة مليئة بالمعرفة

# introTitle0
source: Compare the best teachers with reviews
ar: قارن بين أفضل المدرسين من خلال التقييمات

# introTitle1
source: Late for the assignments, research, and graduation projects required of you!!
ar: مو ملحق على الواجبات والأبحاث ومشاريع التخرج المطلوبة منك!!

# introTitle2
source: Do you have a subject that you would like us to explain to you?
ar: عندك موضوع وبدك نشرحه الك؟

# introDisc0
source: Read other students' experiences with teachers transparently, choose the teacher that suits you, and don't forget to attend the free part of each course
ar: اقرأ تجارب الطلاب الآخرين مع المدرسين بكل شفافية واختر المدرس الذي يناسبك ولا تنسى حضور الجزء المجاني من كل دورة

# introDisc1
source: Easy, request assistance with assignments, research, and projects and get the solution from us.
ar: سهلة , اطلب خدمة المساعدة في الواجبات والأبحاث والمشاريع وحلها عنا.

# introDisc2
source: Simple, request a special explanation request, write the subject you want to explain, and receive a video explaining your subject in detail.
ar: بسيطة , اطلب طلب شرح خاص واكتب الموضوع المراد شرحه واستلم فيديو يشرح بالتفصيل موضوعك.

# invalidPhoneNum
source: Invalid phone number
ar: رقم الهاتف غير صحيح

# pinCodeBlockMsg
source: We have blocked all requests from this device due to unusual activity
ar: لقد قمنا بحظر جميع الطلبات من هذا الجهاز بسبب نشاط غير عادي

source: Create Account
ar: انشاء حساب

# createAccountMsg
source: Please enter the following information to create an account
ar: يرجى إدخال البيانات التالية لإنشاء حساب

# fullNameHint
source: Enter your name here
ar: ادخل الاسم هنا

source: Next
ar: التالي

# confirmPassword
source: Conform Password
ar: تأكيد كلمة المرور

# passwordHint
source: Enter password here
ar: ادخل كلمة المرور هنا

source: Invalid Password
ar: كلمة المرور غير صالحة

# passwordNotMatch
source: password Does not Match
ar: كلمة المرور غير متطابقة

# invalidPhoneCode
source: Invalid Phone Number Code
ar: رمز الهاتف غير صالح

source: Code Expired
ar: انتهت صلاحية الرمز

# enterPhoneCode
source: Enter Verification Code
ar: أدخل رمز التحقق

# verifyCode
source: Verify Account
ar: تفعيل الحساب

# verifyPhoneNum
source: Verify Your Phone Number
ar: تحقق من هاتفك

# verifyCodeMsg
source: Please enter the OTP verification code sent to the WhatsApp.
ar: يرجى إدخال رمز التحقق OTP الذي تم ارساله الى الواتس اب.

# noPinReceived
source: Didn't receive pin code ?
ar: لم يتم استلام الرمز؟

source: Resend
ar: إعادة الإرسال

# accountCreatedMsg
source: Your account has been successfully created.
ar: تم إنشاء حسابك بنجاح

# countriesHint
source: Search for the country name
ar: ابحث عن اسم الدولة

# canChangeUniversity
source: You can change your university at any time
ar: يمكنك تغيير جامعتك في اي وقت

# searchUniversity
source: Search for the university
ar: ابحث عن اسم الجامعة

# searchCollege
source: Search for the college
ar: ابحث عن اسم الكلية

# searchSpecialty
source: Search for the specialty
ar: ابحث عن اسم التخصص

# canChangeCollege
source: You can change your college at any time
ar: يمكنك تغيير الكلية في اي وقت

# canChangeSpecialty
source: You can change your specialty at any time
ar: يمكنك تغيير التخصص في اي وقت

source: Skip
ar: تخطي

# forgetPasswordTitle
source: Forgot Password ?
ar: نسيت كلمة المرور؟

# forgetPasswordBody
source: To reset your password, please enter your mobile phone number and a verification code will be sent.
ar: لإعادة تعيين كلمة المرور يرجى إدخال رقم الهاتف المحمول و سيتم إرسال رمز التحقق.

# resetPasswordTitle
source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordBody
source: The new password must be different from the previous password
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمة المرور السابقة

# passwordUpdatedMsg
source: Password Updated Successfully
ar: تم تحديث كلمة المرور بنجاح

source: Subscribe to this part only
ar: الإشتراك في هذا الجزء فقط

source: Attached file
ar: ملف مرفق

# fillAllFields
source: Please fill out all required fields
ar: يرجى ملئ جميع الحقول المطلوبة

# contactDiscription
source: You can contact Al-Musaed at any time by filling out the following form or clicking on the WhatsApp button to chat directly with your Al-Musaed
ar: يمكنك التواصل مع المساعد في أي وقت من خلال تعبئة النموذج التالي او النقر على زر واتساب للدرشة مباشرة مع مساعدك

source: Your E-mail
ar: بريدك الالكتروني

# contactViaWhatsApp
source: Contact Al-Musaed via WhatsApp
ar: تواصل مع المساعد من خلال واتساب

source: Chat
ar: دردش

# emailHint
source: Enter your email here
ar: ادخل بريدك الالكتروني هنا

# titleHint
source: Enter subject title here
ar: ادخل عنوان الموضوع هنا

# notesHint
source: Enter your notes here
ar: ادخل ملاحظاتك هنا

source: Back
ar: رجوع

# noContent
source: No content has been added yet
ar: لم تتم إضافة أي محتوى حتى الآن

# audioVideoQuality
source: Audio and video quality
ar: جودة الصوت والفيديو

# valueForPrice
source: Value for the price
ar: القيمة بالنسبة للثمن

# teacherAbilityCommunicate
source: Teacher's ability to communicate ideas
ar: قدرة المعلم على ايصال الأفكار

# similarityCurriculumContent
source: Similarity between curriculum and content
ar: التشابه بين المنهج والمحتوى

# basedOnSubsription
source: Based on your subscription in this course ,
ar: بناءا على اشتراكك في هذا الكورس ,

source: rate your experience
ar: قيم تجربتك

# hour
source: h
ar: س

# rateExperienceCourse
source: Rate your experience at {courseName}
ar: قيم تجربتك في {courseName}

# alreadyAddedRating
source: You have already added a rating
ar: لقد قمت بإضافة تقييم مسبقاً

# cannotMoreOneRating
source: You cannot add more than one rating for the same course or professor
ar: لا يمكنك اضافة اكثر من تقييم لنفس الكورس او الأستاذ

# expiredPeriodCourse
source: The subscription period for this course has expired
ar: انتهت فترة الاشتراك في هذا الكورس

source: Unavailable
ar: غير متاح

# ratingAddedSuccess
source: Your rating has been added successfully
ar: تمت اضافة تقييمك بنجاح

# basedOnSubsriptionTeacher
source: Based on your subscription with the professor ,
ar: بناءا على اشتراكك مع الاستاذ ,

# bookPrivateLecture
source: Book a private lecture online with the professor
ar: إحجز موعد محاضرة خاصة اون لاين مع الأستاذ

source: Booking
ar: حجز

# rateExperienceProfessor
source: Rate your experience with {professorName}
ar: قيم تجربتك مع {professorName}

# notSubscribedProfessor
source: You are not subscribed with this professor
ar: انت غير مشترك مع هذا الاستاذ

# mustSubscriberWithProfessor
source: You must be a subscriber with the professor in order to be able to rating him
ar: يجب ان تكون مشتركا مع الاستاذ لتتمكن من تقييمه

# noReviewsYet
source: There are no reviews yet
ar: لا يوجد تقييمات يعد

# feesPaid
source: The fees due to complete the application have been paid
ar: تم دفع الرسوم المستحقة لإنجاز الطلب

# feesNotPaid
source: The fees due to complete the application have not been paid
ar: لم يتم دفع الرسوم المستحقة لإنجاز الطلب

# subscriptionActiveUntil
source: The subscription is active until date:
ar: الاشتراك فعال حتى تاريخ:

# subscriptionEnded
source: Subscription ended on date:
ar: انتهى الاشتراك بتاريخ:

# dontHaveSubscription
source: You don't have any subscriptions yet
ar: لا يوجد لديك اي اشتراكات حتى الآن

source: Online lectures
ar: محاضرات اون لاين

# bookOnlineLecture
source: You can book an online lecture where the professor will explain to you part of one of the following subjects
ar: يمكنك حجز محاضرة اون لاين يشرح لك الأستاذ جزئية من إحدى المواد التالية

source: Please choose
ar: اختر من فضلك

source: Files
ar: ملفات

source: Gallery
ar: المعرض

# noRequestyet
source: You have no requests yet
ar: ليس لديك اي طلبات حتى الآن

# toBookLectureWithProfessor
source: To book an online lecture appointment, please fill out the following form and your request will be sent to the professor directly
ar: لحجز موعد محاضرة اون لاين يرجى تعبئة النموذج التالي وسيتم ارسال طلبك للأستاذ مباشرة

source: Subject
ar: المادة

source: Select subject
ar: اختر المادة

source: Date
ar: التاريخ

source: Suggested date
ar: التاريخ المقترح

# theHour
source: Hour
ar: الساعة

source: Suggested hour
ar: الساعة المقترحة

# hoursRequired
source: Number of hours required
ar: عدد الساعات المطلوبة

source: Hours to be reserved
ar: الساعات المراد حجزها

source: Appointments and bookings
ar: المواعيد والحجوزات

# doYouNeedOnlineLecture
source: Do you need to have an online lecture with one of our teachers? You can submit a request to book an online lecture and get it.
ar: هل انت بحاجة للحصول على محاضرة اون لاين مع مدرس من مدرسينا ؟ يمكنك تقديم طلب حجز محاضرة اون لاين والحصول عليها

source: Previous bookings
ar: الحجوزات السابقة

source: Book with :
ar: حجز مع :

# professorWillCheckAppointment
source: The professor will check the appointment, and if he is not available on the date proposed by you, he will change the appointment to another date
ar: سيقوم الأستاذ بالتحقق من الموعد وفي حال عدم توفره في الموعد المقترح من قبلك سيقوم بتغيير الموعد إلى موعد اخر

# noBookingsYet
source: You don't have bookings yet
ar: ليس لديك حجوزات بعد

# professorNotAvailable
source: Sorry, the professor is not available at the specified hour
ar: عذرا، الأستاذ غير متوفر في الساعة المحددة

# installWhatsApp
source: Please install the WhatsApp application to be able to chat with us
ar: الرجاء تثبيت تطبيق الواتساب لتتمكن من الدردشة معنا

source: Choose payment method
ar: اختر طريقة الدفع

# buyFullCourse
source: Buy the full course
ar: اشتري الكورس كاملاً

# successEditProfile
source: The profile has been successfully modified
ar: تم تعديل الملف الشخصي بنجاح

# checkInfo
source: Please check the information entered
ar: يرجى التحقق من المعلومات المدخلة

# deleteAccountMsg
source: Are you sure you want to delete your account?
ar: هل أنت متأكد انك تريد حذف حسابك ؟

# noCoursesYet
source: There are no courses added yet
ar: لا توجد كورسات مضافة بعد

source: Available times
ar: الأوقات المتاحة

source: Day
ar: اليوم

# phoneNumBody
source: Please enter your phone number to continue
ar: يرجى ادخال رقم الهاتف للمتابعة

# professorAvailable
source: The professor is available from {from} to {to}
ar: الإستاذ متاح من {from} الى {to}
